# üö¢üêºüå≥ Engenharia de Feautes com Pandas 

Neste `notebook` vamos estudar a biblioteca `pandas` usando um conjunto de dados dos passageiros do **titanic**. Por √∫ltimo tentaremos extrair informa√ß√£o dos dados a partir de √°rvores de decis√£o.

![Pandas](dados/944693_1_1029_panda_diplomacy_standard.jpg)


### O Que √© `pandas`?

> ### Python Data Analysis Library
> Um conjunto de ferramentas para an√°lise de dados em `Python`.

## 1. DataFrames
A estrutura de dados mais utilizada em `pandas` √© o [`DataFrame`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html), que armazena os dados na forma de uma tabela. Os dados s√£o indexados pelas colunas ( _columns_ ) e pelas linhas ( _indexes_ ).

Existem v√°rias maneiras de declarar um `DataFrame`. Uma forma comum √© passar um dicion√°rio (`dict`) onde as chaves s√£o as colunas e os valores s√£o listas das linhas:

In [110]:
import pandas as pd

dados = {
    "bamboo": [0, 10, 20],
    "taquara": [5, 15, 25],
    "grama": [-1, -2, None],
}
df_panda = pd.DataFrame(dados)
df_panda

   bamboo  taquara  grama
0       0        5   -1.0
1      10       15   -2.0
2      20       25    NaN

Tamb√©m √© poss√≠vel passar apenas os valores e declarar as colunas ou linhas no construtor do `DataFrame`:

In [7]:
dados = [[0, 5, -1], [10, 15, -2], [20, 25, None]]
pd.DataFrame(dados, columns=["bamboo", "taquara", "grama"])

   bamboo  taquara  grama
0       0        5   -1.0
1      10       15   -2.0
2      20       25    NaN

Provavelmente as formas mais utilizadas para carregar um `DataFrame` s√£o aquelas que carregam dados em disco. Entre os formatos suportados est√£o:
1. CSV
1. Excel
1. HDFS
1. JSON
1. Pickle
1. Parquet
1. SQL

Temos um arquivo `csv` de exemplo em `dados/train.csv`. As primeiras linhas do arquivo s√£o:

In [51]:
ARQUIVO_TRAIN = "dados/train.csv"

with open(ARQUIVO_TRAIN, "r") as fp:
    dados = fp.read()
    print("O arquivo: {0} cont√©m {1} linhas\n".format(ARQUIVO_TRAIN, len(dados.split("\n"))))
    print("\n".join(dados.split("\n")[:5]))

O arquivo: dados/train.csv cont√©m 893 linhas

PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S

Para abrir um arquivo `csv` basta invocar a fun√ß√£o `read_csv` do `pandas`. Os m√©todos `head` e `tail` permitem investigar o come√ßo e o fim do `DataFrame`.

In [78]:
df = pd.read_csv(ARQUIVO_TRAIN)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [136]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### Exerc√≠cios
#### E1.1:
Declare um `DataFrame` com o nome `df_test` abrindo o arquivo `dados/test.csv` usando a fun√ß√£o `read_csv`.

In [138]:
# Preencher a linha abaixo
df_test = 

# Esta linha serve pra mostrar o DataFrame
df_test.head()

SyntaxError: invalid syntax (<ipython-input-138-5c76672f57eb>, line 2)

#### E1.2:
Declare um `DataFrame` com o nome de `df_filmes` contendo os seguintes dados:

|Filme|Ano|Pa√≠s|Amor|
|---|---|---|---|
|Saved from The Titanic|1912|Estados Unidos|False|
|In Nacht und Eis|1912|Alemanha|False|
|Atlantik|1929|Inglaterra/Alemanha|False|
|Titanic|1943|Alemanha|False|
|Titanic|1953|Estados Unidos|False
|A Night to Remember|1958|Inglaterra|False|
|Titanica|1992|Estados Unidos/Russia/Canad√°|False|
|Titanic|1997|Estados Unidos|True|
|La leggenda del Titanic|1999|It√°lia|False|
|Ghosts of the Abyss|2003|Estados Unidos|False|
|[Titanic II](https://en.wikipedia.org/wiki/Titanic_II_(film))|2010|Estados Unidos|False|

In [ ]:
### Responder nas linhas abaixo
df_filmes = 











###

# Esta linha serve pra mostrar o DataFrame
df_filmes

## 2. ... near, far, wherever you are

<img src="dados/titanic-movie-promo-stills-wallpaper-4.jpg" width=800>

Vamos entender um pouco do conjunto de dados que acabamos de carregar. 

Pra quem nunca viu o filme, o navio **RMS Titanic**, considerado inaufrag√°vel, partiu no dia 10 de abril de 1912 de Southampton com destino √† Nova York, fazendo paradas em Cherbourg e Queenstown. √Ås 23:40 da noite do dia 14 de abril o navio colidiu com um iceberg danificando o lado de estibordo da embarca√ß√£o e iniciando a inunda√ß√£o de 5 compartimentos, o que inevit√°velmente causaria seu naufr√°gio.

![Mapa Titanic](dados/Titanic_voyage_map.png)

O navio se parte ao meio √†s 2:20 da madrugada ainda com mais de 1000 passageiros √† bordo. Das estimadas 2224 pessoas √† bordo, cerca de 705 sobreviveram. O Titanic estava a dois dias de viagem de seu destino.

### [spoilers]
> Nesse meio tempo Rose, que est√° noiva, conhece Jack, rola um arrocha, ela larga o boy lixo pra ficar com Jack, o navio afunda e o casal tamb√©m. Rose consegue subir numa porta √† deriva e Jack n√£o tem compet√™ncia suficiente pra subir na porta e acaba morrendo.

<img src="dados/titanic_door.jpg" width=600>

### Conjunto de dados

Cada linha do conjunto de dados representa um passageiro. As colunas s√£o as seguintes:

1. PassengerId: Id √∫nico do passageiro
1. Survived: (1) se o passageiro sobreviveu ao naufr√°gio, (0) caso contr√°rio
1. Pclass: Classe do passageiro (1¬™, 2¬™ ou 3¬™)
1. Name: Nome do passageiro
1. Sex: Sexo do passageiro
1. SibSp: N√∫mero de irm√£os ou esposo(a)s
1. Parch: N√∫mero de pais ou filhos
1. Ticket: N√∫mero do ticket
1. Fare: Tarifa da passagem
1. Cabin: N√∫mero da cabine
1. Embarked: Cidade em que o passageiro embarcou (C - Cherbourg, S - Southampton, Q - Queenstown)

Os dados s√£o da competi√ß√£o de _Machine Learning_ do [Kaggle](https://www.kaggle.com/c/titanic)

### 2.1 Indexa√ß√£o e Sele√ß√£o de dados
O m√©todo `loc` √© utilizado para selecionar dados no `DataFrame`. Este m√©todo implementa o `__getitem__`, ou seja, ao contr√°rio de `__call__` que usa par√™nteses `()` para chamar uma fun√ß√£o, esse m√©todo √© invocado por colchetes `[]`.

In [80]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Para ler uma linha do `DataFrame` basta passar um √∫nico √≠ndice para o m√©todo `loc`:

In [91]:
df.loc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

Tamb√©m √© poss√≠vel passar um intervalo para o m√©todo:

In [66]:
df.loc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

Ou ent√£o uma lista de √≠ndices:

In [71]:
df.loc[[0, 3, 5]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

Para um `DataFrame` tamb√©m √© poss√≠vel selecionar colunas com o m√©todo `loc`:

In [92]:
df.loc[:, ["Name"]].head()

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

Outra forma de indexa√ß√£o √© feita diretamente sobre o objeto do `DataFrame`, selecionando as colunas:

In [96]:
df["Name"].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [97]:
df[["Name"]].head()

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

> ### Pandas Series
√â importante ressaltar que existe outra estrutura de dados importante em `pandas` que se chama `Series`. Esta estrutura representa uma sequ√™ncia de dados de apenas uma dimens√£o, enquanto o `DataFrame` tem duas dimens√µes. An√°logamente as `Series` seriam equivalentes a **listas** enquanto os `DataFrame`s seriam equivalentes √† **matrizes**. Muitos m√©todos dessas duas estruturas s√£o id√™nticos.

### Exerc√≠cios

#### E2.1.1
Qual √© o nome do passageiro na linha `456`?

### 2.2 Indexa√ß√£o Booleana

Algumas opera√ß√µes em `pandas` retornam s√©ries _booleanas_, que podem ser usadas para selecionar (filtrar) os dados. As formas mais comuns de filtragem envolvem a utiliza√ß√£o dos operadores de compara√ß√£o do `python`.

Para selecionar apenas os passageiros da primeira classe, primeiramente √© preciso constrir uma `Series` booleana:

In [135]:
(df["Pclass"] == 1).head()

0    False
1     True
2    False
3     True
4    False
Name: Pclass, dtype: bool

Com a `Series` √© poss√≠vel usar a indexa√ß√£o direta para filtrar os dados:

In [134]:
df[df["Pclass"] == 1].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S

### 2.2. Atribui√ß√£o de valores
Para atribuir um valor √† uma c√©lula √© preciso usar o m√©todo `loc`:

In [112]:
df_panda

   bamboo  taquara  grama
0       0        5   -1.0
1      10       15   -2.0
2      20       25    NaN

In [118]:
df_panda.loc[2, "grama"] = -3
df_panda

   bamboo  taquara  grama floresta
0       0        5   -1.0    densa
1      10       15   -2.0    densa
2      20       25   -3.0    densa

Para atribuir valores √† uma coluna basta usar a indexa√ß√£o direta:

In [121]:
df_panda["floresta"] = "densa"
df_panda

   bamboo  taquara  grama floresta
0       0        5   -1.0    densa
1      10       15   -2.0    densa
2      20       25   -3.0    densa

A atribui√ß√£o por coluna tamb√©m pode receber uma s√©rie:

In [124]:
df_panda["bamboo"] >= 10

0    False
1     True
2     True
Name: bamboo, dtype: bool

In [109]:
df_panda

   bamboo  taquara  grama
0       0        5   -1.0
1      10       15   -2.0
2      20       25    NaN
4      10       10   10.0